In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### pivot
ピボットテーブルを作成

In [2]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.pivot(columns='sex', values='survived').head()

sex  female  male
0       NaN   0.0
1       1.0   NaN
2       1.0   NaN
3       1.0   NaN
4       NaN   0.0

In [4]:
#重複した結果があるとエラーになる
#df.pivot(index='sex', columns='pclass', values='survived').head()

In [5]:
#重複した結果がある場合はpivot_tableを使用する
df.pivot_table(index='sex', columns='pclass', values='survived').head()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### stack
列から行へのpivot

In [6]:
df = sns.load_dataset("titanic")
df = df[["sex", "survived"]]
df.head()

      sex  survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

In [7]:
df.stack().head()

0  sex           male
   survived         0
1  sex         female
   survived         1
2  sex         female
dtype: object

### unstack
行から列へのpivot

In [8]:
df = sns.load_dataset("titanic")
df = df[["sex", "survived"]]
df = df.stack()
df.head()

0  sex           male
   survived         0
1  sex         female
   survived         1
2  sex         female
dtype: object

In [9]:
df.unstack().head()

      sex survived
0    male        0
1  female        1
2  female        1
3  female        1
4    male        0

### melt

In [16]:
df = sns.load_dataset("iris")
print(df.shape)
df.head()

(150, 5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [15]:
melted = pd.melt(df, id_vars=['species'], var_name='variable', value_name='value')
print(melted.shape)
display(melted.iloc[:5, :])
display(melted.iloc[50:55, :])

(600, 3)

  species      variable  value
0  setosa  sepal_length    5.1
1  setosa  sepal_length    4.9
2  setosa  sepal_length    4.7
3  setosa  sepal_length    4.6
4  setosa  sepal_length    5.0

       species      variable  value
50  versicolor  sepal_length    7.0
51  versicolor  sepal_length    6.4
52  versicolor  sepal_length    6.9
53  versicolor  sepal_length    5.5
54  versicolor  sepal_length    6.5